require 'dxruby'

#マップデータ
#たて15×よこ17のブロックから成る
#0 何もない（キャラが通過できる） 1　障害物(キャラが通過できない)　2　背景(キャラが通過できる)

@map = [
       [1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
       [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0, 1],
       [1, 0, 0, 1, 1, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1],
       [1, 0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 1],
       [1, 0, 2, 2, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1],
       [1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1],
       [1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1],
       [1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1],
       [1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1],
       [1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1]
      ]

#配置パーツ　１ブロック（３２×３２）
@map_tile = []
@map_tile[0] = Image.new(32,32,[30,144,255]) #背景
@map_tile[1] = Image.new(32,32,[255,255,0]) #障害物（ブロック）
@map_tile[2] = Image.new(32,32,[255,255,255]) #背景2(雲)

#キャラクター
@char_tile = Image.new(32,32,[255,0,0])



#30フレームへ変更
Window.fps = 30

Window.loop do
    #map描画
    Window.draw_tile(0,0,@map,@map_tile,0,0,17,15)
    #キャラ描画
    Window.draw(x,y,@char_tile)

    #重力の設定
    #Y軸移動増分の設定
    y_move = (y - y_prev) + f #y_prevは1フレーム前のキャラのY座標 fは重力増分
    #座標増分が１ブロックを超えないように補正(すり抜け防止)
    if y_move > 31
        y_move = 31
    end
    y_prev = y
    y += y_move
    f = 2 #f値を初期化しなおす
end
